# ===========================================
# Задание 1
# Описать функцию вычисления:
# f(x) = x^2, если -2 <= x < 2
# f(x) = x^2 + 4x + 5, если x >= 2
# f(x) = 4, если x < -2
# ===========================================

def f(x):
    if -2 <= x < 2:
        return x ** 2
    elif x >= 2:
        return x ** 2 + 4 * x + 5
    else:
        return 4


print("Задание 1: Вычисление значения функции f(x)")
x = float(input("Введите значение x: "))
print(f"Результат: f({x}) = {f(x)}")

# ===========================================
# Задание 2
# Функция вычисления наибольшего общего делителя (НОД)
# ===========================================

def nod(a, b):
    while b != 0:
        a, b = b, a % b
    return abs(a)


print("\nЗадание 2: Нахождение НОД двух чисел")
a = int(input("Введите первое число a: "))
b = int(input("Введите второе число b: "))
print(f"НОД({a}, {b}) = {nod(a, b)}")

# ===========================================
# Задание 3
# Логическая функция: сумма цифр равна произведению цифр
# ===========================================

def is_sum_equal_product(n):
    n = abs(n)
    digits = [int(d) for d in str(n)]
    s = sum(digits)
    p = 1
    for d in digits:
        p *= d
    return s == p


print("\nЗадание 3: Проверка, равна ли сумма цифр произведению")
n = int(input("Введите целое число: "))
if is_sum_equal_product(n):
    print("Сумма цифр равна произведению цифр")
else:
    print("Сумма цифр не равна произведению цифр")

# ===========================================
# Задание 4
# Функция для вычисления суммы цифр в числе
# ===========================================

def sum_of_digits(n):
    n = abs(n)
    return sum(int(d) for d in str(n))


print("\nЗадание 4: Нахождение суммы цифр числа")
n = int(input("Введите целое число: "))
print(f"Сумма цифр числа {n} = {sum_of_digits(n)}")
